_Rarzrabotki/Rarus/USO2/Documents/УСОERP_РасчетПлощадейОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_РасчетПлощадейОбъектовНедвижимости</Name>
			<Comment>Расчет площадей объектов недвижимости (УСО)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УСОERP_СводныеПлощадиПоОбъектуНедвижимости</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоОбмерамБТИ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыНедвижимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьСобственныхЖилыхПомещений</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьСобственныхНежилыхПомещений</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьСобственныхМашиномест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьЖилыхПомещенийДДУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьНежилыхПомещенийДДУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьМашиноместДДУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьЖилыхПомещенийИнвест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьНежилыхПомещенийИнвест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлощадьМашиноместИнвест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УПН_ДоговорПоНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_РасчетПлощадейОбъектовНедвижимости/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - ТаблицаЗначений - состав полей см. в функции ВводНаОсновании.СоздатьКоллекциюКомандСоздатьНаОсновании
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт
		
КонецПроцедуры

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - ТаблицаЗначений - состав полей см. в функции ВводНаОсновании.СоздатьКоллекциюКомандСоздатьНаОсновании
//
// Возвращаемое значение:
//	 КомандыСоздатьНаОсновании - ТаблицаЗначений - состав полей см. в функции ВводНаОсновании.СоздатьКоллекциюКомандСоздатьНаОсновании
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт
		
	Возврат Неопределено;
	
КонецФункции

#Область Отчеты

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаСводныеПлощади(Запрос, ТекстыЗапроса, Регистры);
	
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.ОбъектЭксплуатации КАК ОбъектЭксплуатации,
	|	ДанныеДокумента.ПоОбмерамБТИ КАК ПоОбмерамБТИ
	|ИЗ
	|	Документ.УСОERP_РасчетПлощадейОбъектовНедвижимости КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период", 			Реквизиты.Период);
	Запрос.УстановитьПараметр("Организация", 		Реквизиты.Организация);
	Запрос.УстановитьПараметр("ОбъектЭксплуатации", Реквизиты.ОбъектЭксплуатации);
	Запрос.УстановитьПараметр("ПоОбмерамБТИ", 		Реквизиты.ПоОбмерамБТИ);
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаСводныеПлощади(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "УСОERP_СводныеПлощадиПоОбъектуНедвижимости";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.Ссылка,
	|	УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.Ссылка.Дата КАК Период,
	|	УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.Ссылка.Организация,
	|	УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.Ссылка.ОбъектЭксплуатации,
	|	УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.Ссылка.ПоОбмерамБТИ,
	|	СУММА(УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.ПлощадьСобственныхЖилыхПомещений) КАК ПлощадьСобственныхЖилыхПомещений,
	|	СУММА(УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.ПлощадьСобственныхНежилыхПомещений) КАК ПлощадьСобственныхНежилыхПомещений,
	|	СУММА(УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.ПлощадьСобственныхМашиномест) КАК ПлощадьСобственныхМашиномест,
	|	СУММА(УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.ПлощадьЖилыхПомещенийДДУ) КАК ПлощадьЖилыхПомещенийДДУ,
	|	СУММА(УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.ПлощадьНежилыхПомещенийДДУ) КАК ПлощадьНежилыхПомещенийДДУ,
	|	СУММА(УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.ПлощадьМашиноместДДУ) КАК ПлощадьМашиноместДДУ,
	|	СУММА(УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.ПлощадьЖилыхПомещенийИнвест) КАК ПлощадьЖилыхПомещенийИнвест,
	|	СУММА(УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.ПлощадьНежилыхПомещенийИнвест) КАК ПлощадьНежилыхПомещенийИнвест,
	|	СУММА(УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.ПлощадьМашиноместИнвест) КАК ПлощадьМашиноместИнвест,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.Договор, ЗНАЧЕНИЕ(Документ.УПН_ДоговорПоНедвижимости.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Документ.УПН_ДоговорПоНедвижимости.ПустаяСсылка)
//	|					И &ДатаНачалаСтроительстваСоцИнфраструктуры <= УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.Договор.ДатаДоговора
	|				ТОГДА УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.ПлощадьЖилыхПомещенийДДУ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПлощадьЖилыхПомещенийДДУЗаСчетСредствДольщиков,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.Договор, ЗНАЧЕНИЕ(Документ.УПН_ДоговорПоНедвижимости.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Документ.УПН_ДоговорПоНедвижимости.ПустаяСсылка)
	//|					И &ДатаНачалаСтроительстваСоцИнфраструктуры <= УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.Договор.ДатаДоговора
	|				ТОГДА УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.ПлощадьЖилыхПомещенийИнвест
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПлощадьЖилыхПомещенийИнвестЗаСчетСредствДольщиков
	|ИЗ
	|	Документ.УСОERP_РасчетПлощадейОбъектовНедвижимости.ОбъектыНедвижимости КАК УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости
	|ГДЕ
	|	УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.Ссылка,
	|	УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.Ссылка.Дата,
	|	УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.Ссылка.Организация,
	|	УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.Ссылка.ОбъектЭксплуатации,
	|	УСОERP_РасчетПлощадейОбъектовНедвижимостиОбъектыНедвижимости.Ссылка.ПоОбмерамБТИ" ;
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Функция ПолноеИмяОбъекта()
	Возврат "Документ.УСОERP_РасчетПлощадейОбъектовНедвижимости";
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
